# Dotfiles dependency bundle. Run: brew bundle [--file=Brewfile]
# See docs/setup.md and README for bootstrap flow.

# Taps for formulae/casks not in homebrew-core
tap "FelixKratz/formulae"
tap "nikitabobko/tap"

# Core: required for stow and shell
brew "git"
brew "stow"
brew "fzf"

# Terminal / prompt
brew "gitmux" # tmux status git (catppuccin gitmux module)
brew "starship"
brew "eza"
brew "bat"
brew "zoxide"
brew "sheldon"

# Plugins and helpers
brew "jq"
brew "switchaudio-osx"

# Menu bar and tiling (optional: comment out if you install manually)
brew "sketchybar"
brew "borders" # JankyBorders: window focus borders (FelixKratz/formulae)
cask "nikitabobko/tap/aerospace"

# GUI apps (cask)
cask "ghostty"
cask "karabiner-elements"

# Shell lint/format (recommended for editing support scripts)
brew "neovim"
brew "shellcheck"
brew "shfmt"

# Optional: version/env management and shell enhancements (see docs/setup.md)
# brew "mise"
# brew "atuin"
# brew "direnv"
